In [3]:
#Exercise 1: Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels

import pandas as pd
import numpy as np
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [28]:
pd_exam_data=pd.DataFrame(exam_data,index=['a','b','c','d','e','f','g','h','i','j'])
pd_exam_data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [21]:
#Exercise 2: Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15
pd_exam_data.loc[(pd_exam_data['attempts']<2) & (pd_exam_data['score']>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [32]:
#Exerise 3: Change the value in row 'd' to 11.5
print("\n Original Data Frame:")
print(pd_exam_data)

print("\nChange the score in row 'd' to 11.5:")
pd_exam_data.loc['d','score']=11.5
print(pd_exam_data)
#pd_exam_data=pd_exam_data['score'].fillna('11.5')
#pd_exam_data

 Original Data Frame:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Change the score in row 'd' to 11.5:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [53]:
#Exercise 4: Write a Pandas program to calculate the sum of the examination attempts by the students.

numatt=pd_exam_data['attempts'].sum()
#print(numatt)
print("\nsum of the examination attempts by the students: ",numatt)

sum of the examination attempts by the students:  19

In [58]:
#Exercise 5: Drop a list of rows from a specified DataFrame
drop_exam_data=pd_exam_data.drop(pd_exam_data.index[[2,9]])

print(drop_exam_data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no

In [60]:
#Exercise 6: Check whether a given column is present in a DataFrame or note
if 'new' in drop_exam_data.columns:
    print("column is present")
else:
    print("Column is not present")
    
if 'score' in drop_exam_data.columns:
    print("column is present")
else:
    print("Column is not present")

Column is not present
column is present

In [63]:
#Exercise 7: Get column index from column name of a given DataFrame
print(pd_exam_data)
col_indx=pd_exam_data.columns.get_loc('attempts')
print("Column 'attempts' is present in the index {}".format(col_indx))

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
Column 'attempts' is present in the index 2

In [66]:
#Exercise 8: Write a Pandas program to select all columns, except one given column in a DataFrame.
print("Dataframe without score")
pd_exam_data.loc[:,pd_exam_data.columns!='score']

Dataframe without score

        name  attempts qualify
a  Anastasia         1     yes
b       Dima         3      no
c  Katherine         2     yes
d      James         3      no
e      Emily         2      no
f    Michael         3     yes
g    Matthew         1     yes
h      Laura         1      no
i      Kevin         2      no
j      Jonas         1     yes

In [71]:
#Exercise 9: Write a Pandas program to remove last n rows of a given DataFrame.
after_rmv_rows=pd_exam_data.iloc[:5]
print(after_rmv_rows)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no

In [97]:
#Exercise 10: Display the movies longer than 30 minutes and shorter than 360 minutes
movie_df=pd.read_csv("IMDB-Movie-Data.csv")
#print(movie_df.shape)
#print(movie_df.columns)

movie_df.rename(columns={'Runtime (Minutes)':'Runtime'},inplace=True)
#movie_df.
print("\nDisplay the movies longer than 30 minutes and shorter than 360 minutes")
movie_time=movie_df.loc[(movie_df['Runtime']>30) & (movie_df['Runtime']<360)]
print("\n",movie_time)

Display the movies longer than 30 minutes and shorter than 360 minutes

      Rank                    Title                     Genre  \
0       1  Guardians of the Galaxy   Action,Adventure,Sci-Fi
1       2               Prometheus  Adventure,Mystery,Sci-Fi
2       3                    Split           Horror,Thriller
3       4                     Sing   Animation,Comedy,Family
4       5            Suicide Squad  Action,Adventure,Fantasy
..    ...                      ...                       ...
995   996     Secret in Their Eyes       Crime,Drama,Mystery
996   997          Hostel: Part II                    Horror
997   998   Step Up 2: The Streets       Drama,Music,Romance
998   999             Search Party          Adventure,Comedy
999  1000               Nine Lives     Comedy,Family,Fantasy

                                           Description              Director  \
0    A group of intergalactic criminals are forced ...            James Gunn
1    Following clues to the origin of mankind, a te...          Ridley Scott
2    Three girls are kidnapped by a man with a diag...    M. Night Shyamalan
3    In a city of humanoid animals, a hustling thea...  Christophe Lourdelet
4    A secret government agency recruits some of th...            David Ayer
..                                                 ...                   ...
995  A tight-knit team of rising investigators, alo...             Billy Ray
996  Three American college students studying abroa...              Eli Roth
997  Romantic sparks occur between two dance studen...            Jon M. Chu
998  A pair of friends embark on a mission to reuni...        Scot Armstrong
999  A stuffy businessman finds himself trapped ins...      Barry Sonnenfeld

                                                Actors  Year  Runtime  Rating  \
0    Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...  2014      121     8.1
1    Noomi Rapace, Logan Marshall-Green, Michael Fa...  2012      124     7.0
2    James McAvoy, Anya Taylor-Joy, Haley Lu Richar...  2016      117     7.3
3    Matthew McConaughey,Reese Witherspoon, Seth Ma...  2016      108     7.2
4    Will Smith, Jared Leto, Margot Robbie, Viola D...  2016      123     6.2
..                                                 ...   ...      ...     ...
995  Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...  2015      111     6.2
996  Lauren German, Heather Matarazzo, Bijou Philli...  2007       94     5.5
997  Robert Hoffman, Briana Evigan, Cassie Ventura,...  2008       98     6.2
998  Adam Pally, T.J. Miller, Thomas Middleditch,Sh...  2014       93     5.6
999  Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...  2016       87     5.3

      Votes  Revenue (Millions)  Metascore
0    757074              333.13       76.0
1    485820              126.46       65.0
2    157606              138.12       62.0
3     60545              270.32       59.0
4    393727              325.02       40.0
..      ...                 ...        ...
995   27585                 NaN       45.0
996   73152               17.54       46.0
997   70699               58.01       50.0
998    4881                 NaN       22.0
999   12435               19.64       11.0

[1000 rows x 12 columns]